Autodesk.Revit.DB.Events.LoadLinkExceptionEventArgs.GetModelPath
Returns the model path of the loading link document.
Returns:
The model path of the loading link document.
Since:
2027

Autodesk.Revit.DB.Events.LoadLinkExceptionEventArgs.DocumentType
Type of the document, e.g. Project or Template.
Since:
2027

Autodesk.Revit.DB.Events.LoadLinkExceptionEventArgs.KeepLoading
Indicates whether to continue the Revit file loading process or abort it with an exception.
Since:
2027

Autodesk.Revit.DB.Events.LoadLinkExceptionEventArgs
The event arguments used by the LoadLinkException event.
Since:
2027